In [2]:
import pandas as pd

In [8]:
Series=pd.Series([4,8,15,16,23,42])
Series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:
list=['omkar','chavan','1','2','3','4','shivaji','Satwashila','Abijit','99898989']

Elements=pd.Series(list)
Elements

0         omkar
1        chavan
2             1
3             2
4             3
5             4
6       shivaji
7    Satwashila
8        Abijit
9      99898989
dtype: object

In [15]:
Name=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]
df=pd.DataFrame(Name,columns=['Name','Age','Gender'])
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Answer:-
1)pandas series are one dimensional where Dataframes are 2 dimesntional.
2)Pandas series should have same type of data but while Dataframe can have diffrent types of data.
3)series is immutable while dataframe is mutable

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Answer:-
1)d.types:- it is used to check types of data in the framework with the headers.
2)df.header(5):-Can check first 5 datas of the data frame
3)df.tail(5):-Can check the last 5 Datas.
4)pd.

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer:-
    Dataframe is mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
Names=pd.Series(['Omkar','Abhijit','Urmila','Sharmila'])
Sur_name=pd.Series(['Chavan','Chavan','More','More'])
Age=pd.Series([26,30,25,25])

df1=pd.concat([Names,Sur_name,Age],axis=1)
df1

          0       1   2
0     Omkar  Chavan  26
1   Abhijit  Chavan  30
2    Urmila    More  25
3  Sharmila    More  25

We can use concat function in python to concat the data with pandas.